"""Series""""

In [14]:
import pandas as pd

In [2]:
Age = pd.Series([10, 20, 30, 40], index=['age1', 'age2', 'age3','age4'])
Age

age1    10
age2    20
age3    30
age4    40
dtype: int64

In [5]:
Age.age2

20

In [7]:
Filtered_Age = Age[Age>20]
Filtered_Age

age3    30
age4    40
dtype: int64

In [8]:
#Calling values of the Series
Age.values

array([10, 20, 30, 40])

In [9]:
#Calling indices of the Series
Age.index

Index(['age1', 'age2', 'age3', 'age4'], dtype='object')

In [ ]:
Age.index = ['A1', 'A2', 'A3', 'A4']

DataFrame

In [15]:
import numpy as np

In [16]:
df = np.array([[20,10,8],[25,8,10],[27,5,3],[38,9,7]])
df

array([[20, 10,  8],
       [25,  8, 10],
       [27,  5,  3],
       [38,  9,  7]])

In [18]:
#Transforma df de array para Dataframe
Data_Set = pd.DataFrame(df)
Data_Set

    0   1   2
0  20  10   8
1  25   8  10
2  27   5   3
3  38   9   7

In [20]:
#Definindo indices ou legendas para o Dataframe
Data_Set = pd.DataFrame(df, index=['S1','S2','S3','S4'])
Data_Set

     0   1   2
S1  20  10   8
S2  25   8  10
S3  27   5   3
S4  38   9   7

In [23]:
Data_Set = pd.DataFrame(df, index=['S1','S2','S3','S4'], columns=['Age', 'Grade1', 'Grade2'])
Data_Set

    Age  Grade1  Grade2
S1   20      10       8
S2   25       8      10
S3   27       5       3
S4   38       9       7

In [24]:
Data_Set['Grade3'] = [9,6,7,10]
Data_Set

    Age  Grade1  Grade2  Grade3
S1   20      10       8       9
S2   25       8      10       6
S3   27       5       3       7
S4   38       9       7      10

In [53]:
Z=Data_Set.loc['S3']
Z

Age       27
Grade1     5
Grade2     3
Grade3     7
Name: S3, dtype: int64

In [26]:
A=Data_Set.loc['S2']
A

Age       25
Grade1     8
Grade2    10
Grade3     6
Name: S2, dtype: int64

In [28]:
#loc não serve para números apenas label
B=Data_Set.loc[1][3]
B

KeyError: 0

In [30]:
#iloc serve para números
B=Data_Set.iloc[1][3]
B

6

In [32]:
C=Data_Set.iloc[2][2]
C

3

In [34]:
D=Data_Set.iloc[1,3]
D

6

In [37]:
#Recortar coluna
E=Data_Set.iloc[:,1]
E

S1    10
S2     8
S3     5
S4     9
Name: Grade1, dtype: int64

In [46]:
#Filtrar linhas
Filtered_Data =Data_Set.iloc[3:4]
Filtered_Data

    Age  Grade1  Grade2  Grade3
S4   38       9       7      10

In [48]:
Filtered_Data = Data_Set.iloc[:,1:3]
Filtered_Data

    Grade1  Grade2
S1      10       8
S2       8      10
S3       5       3
S4       9       7

In [56]:
# para salvar a remoção da grade 1: Data_Set = Data_Set.drop('Grade1', axis1)
Q = Data_Set.drop('Grade1', axis=1)
Q

    Age  Grade2  Grade3
S1   20       8       9
S2   25      10       6
S3   27       3       7
S4   38       7      10

In [58]:
#Trocar os valores '10' por 12

Data_Set = Data_Set.replace(10,12)
Data_Set

    Age  Grade1  Grade2  Grade3
S1   20      12       8       9
S2   25       8      12       6
S3   27       5       3       7
S4   38       9       7      12

In [62]:
Data_Set = Data_Set.replace({12:10, 7:30})
Data_Set

    Age  Grade1  Grade2  Grade3
S1   20      10       8      10
S2   25       8      10       6
S3   27       5       3      30
S4   38      10      30      10

In [63]:
Data_Set.head(3)

    Age  Grade1  Grade2  Grade3
S1   20      10       8      10
S2   25       8      10       6
S3   27       5       3      30

In [64]:
Data_Set.tail(2)

    Age  Grade1  Grade2  Grade3
S3   27       5       3      30
S4   38      10      30      10

In [66]:
#Ordena os valores em ordem crescente
W=Data_Set.sort_values('Grade1', ascending=True)
W

    Age  Grade1  Grade2  Grade3
S3   27       5       3      30
S2   25       8      10       6
S1   20      10       8      10
S4   38      10      30      10

In [69]:
#Ordena os valores em ordem decrescente
T=Data_Set.sort_index(axis=0,ascending=False)
T

    Age  Grade1  Grade2  Grade3
S4   38      10      30      10
S3   27       5       3      30
S2   25       8      10       6
S1   20      10       8      10

In [70]:
Data = pd.read_csv('Data_Set.csv')
Data.head()

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Unit = kW and $/kW,NaN,NaN,NaN,NaN,NaN
1,Time,E_Plug,E_Heat,Price,Temperature,No. Occupants
2,1,24,28,10,-15,12
3,2,17,32,12,-17,12
4,3,16,34,11,-19,12

In [ ]:
plt.xlabel('Year')
plt.ylabel('Temp_Index')
plt.title('Global Warming')
plt.show()